/*
 Navicat Premium Data Transfer

 Source Server         : MongoDB
 Source Server Type    : MongoDB
 Source Server Version : 40210
 Source Host           : localhost:27017
 Source Schema         : web

 Target Server Type    : MongoDB
 Target Server Version : 40210
 File Encoding         : 65001

 Date: 13/02/2021 14:54:03
*/


// ----------------------------
// Collection structure for roles
// ----------------------------
db.getCollection("roles").drop();
db.createCollection("roles");

// ----------------------------
// Documents of roles
// ----------------------------
db.getCollection("roles").insert([ {
    _id: ObjectId("602342aa6683cf3d849f63c4"),
    resources: [
        "6023d24ccf5700003e002223",
        "6023d31ccf5700003e002224",
        "6023d38bcf5700003e002225",
        "6023d468cf5700003e002226",
        "6023d4bccf5700003e002227",
        "6023d686c720000048007232",
        "6023db71c720000048007233",
        "6023db83c720000048007234",
        "6023dbb7c720000048007235",
        "6023dbf6c720000048007236",
        "6023dc31c720000048007237",
        "6023dc98c720000048007238",
        "6023dcf6c720000048007239",
        "6023dd1fc72000004800723a",
        "6023dd4ec72000004800723b",
        "6023dd77c72000004800723c",
        "6023dda1c72000004800723d",
        "6023de25c72000004800723e",
        "6023de3bc72000004800723f",
        "6023de9ec720000048007240",
        "6023deaec720000048007241",
        "6023deedc720000048007242",
        "6023df1dc720000048007243",
        "6023dfc6c720000048007244",
        "6023dfddc720000048007245",
        "6023e029c720000048007246",
        "6023e120c720000048007247",
        "6023e17fc720000048007249",
        "6023e1aac72000004800724a",
        "6025565ae0c73e3e709536c9",
        "602556aa8b901b3914b10c67",
        "602557d8cbfca72d487e1215",
        "6025580acbfca72d487e1216",
        "60255825cbfca72d487e1217",
        "6025585ecbfca72d487e1218",
        "6025588bcbfca72d487e1219",
        "60255a2459c89f09ac574c52",
        "60255a4459c89f09ac574c53",
        "60255a8e59c89f09ac574c54",
        "60255aee59c89f09ac574c55",
        "60255b1259c89f09ac574c56",
        "60255b3959c89f09ac574c57",
        "60255b6f59c89f09ac574c58",
        "60255ba659c89f09ac574c59",
        "60255bce59c89f09ac574c5a",
        "60255bfd59c89f09ac574c5b",
        "60255c2659c89f09ac574c5c",
        "60255c4659c89f09ac574c5d",
        "60255c6859c89f09ac574c5e",
        "60255c8559c89f09ac574c5f",
        "60255cb259c89f09ac574c60",
        "60255ce359c89f09ac574c61",
        "60255d0259c89f09ac574c62",
        "60255d6859c89f09ac574c63",
        "60255ddb59c89f09ac574c64",
        "60255dfe59c89f09ac574c65",
        "60255e1159c89f09ac574c66",
        "60255e2e59c89f09ac574c67",
        "60255e5759c89f09ac574c68",
        "60255e7159c89f09ac574c69",
        "60255e9f59c89f09ac574c6a",
        "60255ebd59c89f09ac574c6b",
        "60255ee659c89f09ac574c6c",
        "60255f0559c89f09ac574c6d",
        "60255f2b59c89f09ac574c6e",
        "60255f4959c89f09ac574c6f",
        "60255f6159c89f09ac574c70",
        "60255f7a59c89f09ac574c71",
        "60255fa159c89f09ac574c72",
        "602560046ecccd18dc480dff",
        "602560236ecccd18dc480e00",
        "6025605b6ecccd18dc480e01",
        "602560876ecccd18dc480e02",
        "602560cf6ecccd18dc480e03",
        "602561096ecccd18dc480e04",
        "6025612b6ecccd18dc480e05",
        "6025614e6ecccd18dc480e06",
        "602561716ecccd18dc480e07",
        "602561ae6ecccd18dc480e08",
        "602562cd6b54601354d30689",
        "602562f56b54601354d3068a",
        "602563176b54601354d3068b",
        "6025ff3c8e22152a48bfc8b3",
        "60260aaa43383e060c0f430a",
        "60260adb43383e060c0f430b",
        "60260b6743383e060c0f430c",
        "60260b8143383e060c0f430d",
        "60260da043383e060c0f430e",
        "60260e0143383e060c0f430f",
        "60260e3043383e060c0f4310",
        "60260e9043383e060c0f4311",
        "60260eaa43383e060c0f4312",
        "60260eca43383e060c0f4313",
        "60260eff43383e060c0f4314",
        "60260f1343383e060c0f4315",
        "60260f6043383e060c0f4316",
        "60260f9a43383e060c0f4317",
        "60260fb943383e060c0f4318",
        "60260fd043383e060c0f4319",
        "6026102443383e060c0f431a",
        "6026103943383e060c0f431b",
        "6026107a43383e060c0f431c",
        "602610d943383e060c0f431d",
        "602610f043383e060c0f431e",
        "6026111043383e060c0f431f",
        "6026113f43383e060c0f4320",
        "602611fa43383e060c0f4321",
        "6026121f43383e060c0f4322",
        "6026123a43383e060c0f4323",
        "6026125e43383e060c0f4324",
        "6026128943383e060c0f4325",
        "602612a943383e060c0f4326",
        "602612c343383e060c0f4327",
        "6026138943383e060c0f4328",
        "602613a343383e060c0f4329",
        "602613b843383e060c0f432a",
        "602613ea43383e060c0f432b",
        "602613fd43383e060c0f432c",
        "6026145a43383e060c0f432d",
        "6026147043383e060c0f432e",
        "6026368743383e060c0f433a",
        "60263a1743383e060c0f4341",
        "60263a6443383e060c0f4342",
        "602642f543383e060c0f4343",
        "6026438c43383e060c0f4344",
        "60268033e573bd2a84a4f74b",
        "60268128e573bd2a84a4f74c",
        "60268c8cf0c5ec23f48b3e19",
        "60268d29f0c5ec23f48b3e1a",
        "60268d91f0c5ec23f48b3e1b",
        "60268da2f0c5ec23f48b3e1c",
        "60268e48f0c5ec23f48b3e1d",
        "60268ed2f0c5ec23f48b3e1e",
        "60268ee9f0c5ec23f48b3e1f",
        "60268f58f0c5ec23f48b3e20",
        "60268fa0f0c5ec23f48b3e21",
        "6026900bf0c5ec23f48b3e22",
        "6026906ff0c5ec23f48b3e23",
        "60269085f0c5ec23f48b3e24",
        "602690def0c5ec23f48b3e25",
        "60269140f0c5ec23f48b3e26",
        "602691e9f0c5ec23f48b3e27",
        "6026924ff0c5ec23f48b3e28",
        "602692b8f0c5ec23f48b3e29",
        "60269350f0c5ec23f48b3e2a",
        "60269398f0c5ec23f48b3e2b",
        "602693f9f0c5ec23f48b3e2c",
        "60269408f0c5ec23f48b3e2d",
        "60269457f0c5ec23f48b3e2e",
        "60269499f0c5ec23f48b3e2f",
        "602694e5f0c5ec23f48b3e30",
        "60269c7f028b1e36d0f06a90",
        "60269d0a028b1e36d0f06a91",
        "60269d35028b1e36d0f06a92",
        "60269dd7028b1e36d0f06a93",
        "60274cd9e7eee320a0cf033a",
        "602753b69921b12934e6a8b7",
        "602761a248c15129f4c920a3",
        "602761c248c15129f4c920a4",
        "602761ed48c15129f4c920a5",
        "6027620748c15129f4c920a6",
        "602775a1f3403f43ecdedafc"
    ],
    name: "超级管理员",
    code: "role_admin",
    __v: NumberInt("0")
} ]);
db.getCollection("roles").insert([ {
    _id: ObjectId("6024921b6378000020007252"),
    name: "自我信息修改",
    code: "role_miniadmin",
    resources: [
        "6025580acbfca72d487e1216",
        "6025585ecbfca72d487e1218",
        "60255a8e59c89f09ac574c54",
        "60260aaa43383e060c0f430a"
    ]
} ]);
db.getCollection("roles").insert([ {
    _id: ObjectId("6026051043383e060c0f4307"),
    resources: [
        "6023d24ccf5700003e002223",
        "6023d31ccf5700003e002224",
        "6023d38bcf5700003e002225",
        "6023d468cf5700003e002226",
        "6023d4bccf5700003e002227",
        "6023d686c720000048007232",
        "6023db71c720000048007233",
        "6023db83c720000048007234",
        "6023dbb7c720000048007235",
        "6023dbf6c720000048007236",
        "6023dc31c720000048007237",
        "6023dc98c720000048007238",
        "6023dcf6c720000048007239",
        "6023dd1fc72000004800723a",
        "6023dd4ec72000004800723b",
        "6023dd77c72000004800723c",
        "6023dda1c72000004800723d",
        "6023de25c72000004800723e",
        "6023de3bc72000004800723f",
        "6023de9ec720000048007240",
        "6023deaec720000048007241",
        "6023deedc720000048007242",
        "6023df1dc720000048007243",
        "6023dfc6c720000048007244",
        "6023dfddc720000048007245",
        "6023e029c720000048007246",
        "6023e120c720000048007247",
        "6023e17fc720000048007249",
        "6023e1aac72000004800724a",
        "602761a248c15129f4c920a3",
        "602761c248c15129f4c920a4",
        "602761ed48c15129f4c920a5",
        "6027620748c15129f4c920a6"
    ],
    name: "视图测试员",
    code: "role_viewtest",
    __v: NumberInt("0")
} ]);
db.getCollection("roles").insert([ {
    _id: ObjectId("6026218443383e060c0f432f"),
    resources: [
        "6023d24ccf5700003e002223",
        "6023d31ccf5700003e002224",
        "6023d38bcf5700003e002225",
        "60260b6743383e060c0f430c",
        "60260b8143383e060c0f430d",
        "60260da043383e060c0f430e",
        "60260e0143383e060c0f430f",
        "60255a4459c89f09ac574c53",
        "60255a2459c89f09ac574c52",
        "6025588bcbfca72d487e1219",
        "60260e3043383e060c0f4310"
    ],
    name: "文章管理员",
    code: "role_articlemanager",
    __v: NumberInt("0")
} ]);
db.getCollection("roles").insert([ {
    _id: ObjectId("60262cc143383e060c0f4331"),
    resources: [
        "6023d468cf5700003e002226",
        "6023d4bccf5700003e002227",
        "6026145a43383e060c0f432d",
        "6026147043383e060c0f432e",
        "602563176b54601354d3068b"
    ],
    name: "前端账号管理员",
    code: "role_webusermanager",
    __v: NumberInt("0")
} ]);
db.getCollection("roles").insert([ {
    _id: ObjectId("60262fe843383e060c0f4332"),
    resources: [
        "6023e120c720000048007247",
        "6023e17fc720000048007249",
        "6023e1aac72000004800724a",
        "60260a2e43383e060c0f4309",
        "60260aaa43383e060c0f430a",
        "60260adb43383e060c0f430b",
        "6023d686c720000048007232",
        "60255825cbfca72d487e1217",
        "6025580acbfca72d487e1216",
        "6025585ecbfca72d487e1218",
        "602557d8cbfca72d487e1215",
        "6026125e43383e060c0f4324",
        "60255b1259c89f09ac574c56",
        "60255aee59c89f09ac574c55",
        "60255c6859c89f09ac574c5e",
        "60255c8559c89f09ac574c5f",
        "60255cb259c89f09ac574c60",
        "602611fa43383e060c0f4321",
        "6026121f43383e060c0f4322",
        "6026123a43383e060c0f4323",
        "60255b6f59c89f09ac574c58",
        "60255ba659c89f09ac574c59",
        "60255bce59c89f09ac574c5a",
        "60255bfd59c89f09ac574c5b",
        "60255c2659c89f09ac574c5c",
        "60255c4659c89f09ac574c5d",
        "602610d943383e060c0f431d",
        "602610f043383e060c0f431e",
        "6026111043383e060c0f431f",
        "6026113f43383e060c0f4320",
        "602642f543383e060c0f4343",
        "6026438c43383e060c0f4344",
        "60274cd9e7eee320a0cf033a"
    ],
    name: "权限管理员",
    code: "role_authoritymanager",
    __v: NumberInt("0")
} ]);
db.getCollection("roles").insert([ {
    _id: ObjectId("6026344943383e060c0f4335"),
    resources: [
        "6023db71c720000048007233",
        "6023db83c720000048007234",
        "60260f6043383e060c0f4316",
        "6025565ae0c73e3e709536c9",
        "602556aa8b901b3914b10c67"
    ],
    name: "站内信息管理员",
    code: "role_adminmessagemanager",
    __v: NumberInt("0")
} ]);
db.getCollection("roles").insert([ {
    _id: ObjectId("602634a343383e060c0f4337"),
    resources: [
        "6023db71c720000048007233",
        "6023dbb7c720000048007235",
        "60255e7159c89f09ac574c69",
        "6026107a43383e060c0f431c",
        "60255e5759c89f09ac574c68"
    ],
    name: "公告管理员",
    code: "role_noticemanager",
    __v: NumberInt("0")
} ]);
db.getCollection("roles").insert([ {
    _id: ObjectId("602635df43383e060c0f4339"),
    resources: [
        "6023dbf6c720000048007236",
        "60255ce359c89f09ac574c61",
        "60255d0259c89f09ac574c62",
        "60255d6859c89f09ac574c63",
        "6026368743383e060c0f433a"
    ],
    name: "评论管理员",
    code: "role_commentmanager",
    __v: NumberInt("0")
} ]);
db.getCollection("roles").insert([ {
    _id: ObjectId("602638c443383e060c0f433b"),
    resources: [
        "6023dc31c720000048007237",
        "6023dc98c720000048007238",
        "6023dd4ec72000004800723b",
        "60255fa159c89f09ac574c72",
        "602560046ecccd18dc480dff",
        "602560236ecccd18dc480e00",
        "60260f9a43383e060c0f4317",
        "60260fb943383e060c0f4318",
        "60260fd043383e060c0f4319",
        "6026102443383e060c0f431a",
        "6026103943383e060c0f431b"
    ],
    name: "音视频管理员",
    code: "role_musicvideomanager",
    __v: NumberInt("0")
} ]);
db.getCollection("roles").insert([ {
    _id: ObjectId("602638e243383e060c0f433c"),
    resources: [
        "6023dcf6c720000048007239",
        "6023dd77c72000004800723c",
        "60255dfe59c89f09ac574c65",
        "60255e1159c89f09ac574c66",
        "60255e2e59c89f09ac574c67",
        "60260eaa43383e060c0f4312",
        "60260eca43383e060c0f4313",
        "60260eff43383e060c0f4314",
        "60260e9043383e060c0f4311",
        "60260f1343383e060c0f4315",
        "6023dc31c720000048007237"
    ],
    name: "图包管理员",
    code: "role_imagemanager",
    __v: NumberInt("0")
} ]);
db.getCollection("roles").insert([ {
    _id: ObjectId("602638f643383e060c0f433d"),
    resources: [
        "6023dd1fc72000004800723a",
        "6023dda1c72000004800723d",
        "60255f4959c89f09ac574c6f",
        "60255f6159c89f09ac574c70",
        "60255f7a59c89f09ac574c71",
        "6026138943383e060c0f4328",
        "602613a343383e060c0f4329",
        "602613b843383e060c0f432a",
        "602613fd43383e060c0f432c",
        "602613ea43383e060c0f432b",
        "6023dc31c720000048007237"
    ],
    name: "工具管理员",
    code: "role_toolmanager",
    __v: NumberInt("0")
} ]);
db.getCollection("roles").insert([ {
    _id: ObjectId("6026391f43383e060c0f433e"),
    resources: [
        "6023de25c72000004800723e",
        "6023de3bc72000004800723f",
        "6025605b6ecccd18dc480e01",
        "602560876ecccd18dc480e02",
        "602560cf6ecccd18dc480e03",
        "602561096ecccd18dc480e04",
        "6025612b6ecccd18dc480e05",
        "6025614e6ecccd18dc480e06",
        "602561716ecccd18dc480e07",
        "602561ae6ecccd18dc480e08",
        "602562cd6b54601354d30689",
        "6025ff3c8e22152a48bfc8b3",
        "60263a1743383e060c0f4341",
        "60263a6443383e060c0f4342"
    ],
    name: "虚拟文件管理员",
    code: "role_virtualfilemanager",
    __v: NumberInt("0")
} ]);
db.getCollection("roles").insert([ {
    _id: ObjectId("6026393c43383e060c0f433f"),
    resources: [
        "6023de9ec720000048007240",
        "6023deaec720000048007241",
        "6023deedc720000048007242",
        "6023df1dc720000048007243",
        "602562f56b54601354d3068a",
        "6026128943383e060c0f4325",
        "602612a943383e060c0f4326",
        "602612c343383e060c0f4327"
    ],
    name: "网站设置管理员",
    code: "role_adminsetmanager",
    __v: NumberInt("0")
} ]);
db.getCollection("roles").insert([ {
    _id: ObjectId("6026395043383e060c0f4340"),
    resources: [
        "6023dfc6c720000048007244",
        "6023dfddc720000048007245",
        "6023e029c720000048007246",
        "60255e9f59c89f09ac574c6a",
        "60255ebd59c89f09ac574c6b",
        "60255ee659c89f09ac574c6c",
        "60255f0559c89f09ac574c6d",
        "60255f2b59c89f09ac574c6e"
    ],
    name: "统计管理员",
    code: "role_statsmanager",
    __v: NumberInt("0")
} ]);
